morpheby/arduino_core_ch32/cores/arduino/HardwareTimer.cpp
/*
  Copyright (c) 2017 Daniel Fekete

  Permission is hereby granted, free of charge, to any person obtaining a copy
  of this software and associated documentation files (the "Software"), to deal
  in the Software without restriction, including without limitation the rights
  to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
  copies of the Software, and to permit persons to whom the Software is
  furnished to do so, subject to the following conditions:

  The above copyright notice and this permission notice shall be included in all
  copies or substantial portions of the Software.

  THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
  IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
  FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
  AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
  LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
  OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
  SOFTWARE.

  Copyright (c) 2019 STMicroelectronics
  Modified to support Arduino_Core_STM32

  Modified by TempersLee to support Adruino_Core_CH32
*/

#include "Arduino.h"
#include "ch32v30x_isr.h"
#include "ch32_clock.h"
#include "core_config.h"
#include "HardwareTimer.h"
#include "ch32vxxx/ch32vxxx_isr.h"
#include "timer.h"

#if defined(TIM_MODULE_ENABLED) && !defined(TIM_MODULE_ONLY)

#ifdef TIM_MODULE_OPTIONAL
#define _TIM_ISR(x) _REMAP_ISR(x, ArduinoTIM_ISR)
#else
#define _TIM_ISR(x) _ISR_DEF(x)
#endif

/* Private Defines */
#define PIN_NOT_USED 0xFF
#define MAX_RELOAD ((1 << 16) - 1) // Currently even 32b timers are used as 16b to have generic behavior


#if defined(TIM1_BASE)
  _TIM_ISR(TIM1_UP_IRQHandler);
  _TIM_ISR(TIM1_CC_IRQHandler);
#endif //TIM1_BASE

#if defined(TIM2_BASE)
  #if defined(CH32X035)
  _TIM_ISR(TIM2_UP_IRQHandler);
  _TIM_ISR(TIM2_CC_IRQHandler);
  #else
  _TIM_ISR(TIM2_IRQHandler);
  #endif
#endif //TIM2_BASE

#if defined(TIM3_BASE)
  _TIM_ISR(TIM3_IRQHandler);
#endif //TIM3_BASE

#if defined(TIM4_BASE)
  _TIM_ISR(TIM4_IRQHandler);
#endif //TIM4_BASE

#if defined(TIM5_BASE)
  _TIM_ISR(TIM5_IRQHandler);
#endif //TIM5_BASE

#if defined(TIM6_BASE)
  _TIM_ISR(TIM6_IRQHandler);
#endif //TIM6_BASE

#if defined(TIM7_BASE)
  _TIM_ISR(TIM7_IRQHandler);
#endif //TIM7_BASE

#if defined(TIM8_BASE)
  _TIM_ISR(TIM8_UP_IRQHandler);
  _TIM_ISR(TIM8_CC_IRQHandler);
#endif //TIM8_BASE

#if defined(TIM9_BASE)
  _TIM_ISR(TIM9_UP_IRQHandler);
  _TIM_ISR(TIM9_CC_IRQHandler);
#endif //TIM9_BASE

#if defined(TIM10_BASE)
  _TIM_ISR(TIM10_UP_IRQHandler);
  _TIM_ISR(TIM10_CC_IRQHandler);
#endif //TIM10_BASE

/* Private Variables */
timerObj_t *HardwareTimer_Handle[TIMER_NUM] = {NULL};

/**
  * @brief  HardwareTimer constructor: make uninitialized timer
  *         Before calling any methods, call setup to select and setup
  *         the timer to be used.
  * @retval None
  */
HardwareTimer::HardwareTimer()
{
  _timerObj.handle.Instance = nullptr;
}

/**
  * @brief  HardwareTimer constructor: set default configuration values
  *         The timer will be usable directly, there is no need to call
  *         setup(). Using this constructor is not recommended for
  *         global variables that are automatically initialized at
  *         startup, since this will happen to early to report any
  *         errors. Better use the argumentless constructor and call the
  *         setup() method during initialization later.
  * @param  Timer instance ex: TIM1, ...
  * @retval None
  */
HardwareTimer::HardwareTimer(TIM_TypeDef *instance)
{
  _timerObj.handle.Instance = nullptr;
  setup(instance);
  
#if defined(TIM1_BASE) 
  NVIC_EnableIRQ(TIM1_UP_IRQn);
  NVIC_EnableIRQ(TIM1_CC_IRQn);
#endif

#ifdef TIM2_BASE 
  #if defined(CH32X035)
    NVIC_EnableIRQ(TIM2_UP_IRQn);
    NVIC_EnableIRQ(TIM2_CC_IRQn);
  #else
    NVIC_EnableIRQ(TIM2_IRQn);
  #endif
#endif

#if defined(TIM3_BASE) && !defined(CH32VM00X)  //v006 has no interruption
  NVIC_EnableIRQ(TIM3_IRQn);  
#endif

#ifdef TIM4_BASE
  NVIC_EnableIRQ(TIM4_IRQn);
#endif

#ifdef CH32V30x

#ifdef TIM5_BASE
  NVIC_EnableIRQ(TIM5_IRQn);
#endif

#ifdef TIM6_BASE
  NVIC_EnableIRQ(TIM6_IRQn);
#endif

#ifdef TIM7_BASE
  NVIC_EnableIRQ(TIM7_IRQn);
#endif

#ifdef TIM8_BASE
  NVIC_EnableIRQ(TIM8_UP_IRQn);
  NVIC_EnableIRQ(TIM8_CC_IRQn);
#endif

#ifdef TIM9_BASE
  NVIC_EnableIRQ(TIM9_UP_IRQn);
  NVIC_EnableIRQ(TIM9_CC_IRQn);
#endif

#ifdef TIM10_BASE
  NVIC_EnableIRQ(TIM10_UP_IRQn);
  NVIC_EnableIRQ(TIM10_CC_IRQn);
#endif

#endif

}

/**
  * @brief  HardwareTimer setup: configuration values. Must be called
  * exactly once before any other methods, except when an instance is
  * passed to the constructor.
  * @param  Timer instance ex: TIM1, ...
  * @retval None
  */
void HardwareTimer::setup(TIM_TypeDef *instance)
{
  uint32_t index = get_timer_index(instance);
  if (index == UNKNOWN_TIMER) {
    Error_Handler();
  }

  // Already initialized?
  if (_timerObj.handle.Instance) {
    Error_Handler();
  }

  HardwareTimer_Handle[index] = &_timerObj;

  _timerObj.handle.Instance = instance;

  _timerObj.__this = (void *)this;
  _timerObj.preemptPriority = TIM_IRQ_PRIO;   
  _timerObj.subPriority = TIM_IRQ_SUBPRIO;
  _timerObj.handle.Init={0}; 
  /* Enable timer clock. Even if it is also done in HAL_TIM_Base_MspInit(),
     it is done there so that it is possible to write registers right now */
  enableTimerClock(&(_timerObj.handle));
  // Initialize NULL callbacks
  for (int i = 0; i < TIMER_CHANNELS + 1 ; i++) {
    callbacks[i] = NULL;
  }

  // Initialize channel mode and complementary
  for (int i = 0; i < TIMER_CHANNELS; i++) {
#if defined(TIM_CC1NE)
    isComplementaryChannel[i] = false;  //如果有互补通道定义
#endif
    _ChannelMode[i] = TIMER_DISABLED;    
  }

#ifdef TIM_MODULE_OPTIONAL
  switch(index) {
#if defined(TIM1_BASE)
  case TIMER1_INDEX:
    ISR_Set_TIM1_UP_IRQHandler(_REMAP_ISR_NAME(TIM1_UP_IRQHandler, ArduinoTIM_ISR));
    ISR_Set_TIM1_CC_IRQHandler(_REMAP_ISR_NAME(TIM1_CC_IRQHandler, ArduinoTIM_ISR));
    break;
#endif //TIM1_BASE

#if defined(TIM2_BASE)
  case TIMER2_INDEX:
  #if defined(CH32X035)
    ISR_Set_TIM2_UP_IRQHandler(_REMAP_ISR_NAME(TIM2_UP_IRQHandler, ArduinoTIM_ISR));
    ISR_Set_TIM2_CC_IRQHandler(_REMAP_ISR_NAME(TIM2_CC_IRQHandler, ArduinoTIM_ISR));
    break;
  #else
    ISR_Set_TIM2_IRQHandler(_REMAP_ISR_NAME(TIM2_IRQHandler, ArduinoTIM_ISR));
    break;
  #endif
#endif //TIM2_BASE

#if defined(TIM3_BASE)
  case TIMER3_INDEX:
    ISR_Set_TIM3_IRQHandler(_REMAP_ISR_NAME(TIM3_IRQHandler, ArduinoTIM_ISR));
    break;
#endif //TIM3_BASE

#if defined(TIM4_BASE)
  case TIMER4_INDEX:
    ISR_Set_TIM4_IRQHandler(_REMAP_ISR_NAME(TIM4_IRQHandler, ArduinoTIM_ISR));
    break;
#endif //TIM4_BASE

#if defined(TIM5_BASE)
  case TIMER5_INDEX:
    ISR_Set_TIM5_IRQHandler(_REMAP_ISR_NAME(TIM5_IRQHandler, ArduinoTIM_ISR));
    break;
#endif //TIM5_BASE

