morpheby/arduino_core_ch32/cores/arduino/HardwareTimer.cpp
#if defined(TIM6_BASE)
  case TIMER6_INDEX:
    ISR_Set_TIM6_IRQHandler(_REMAP_ISR_NAME(TIM6_IRQHandler, ArduinoTIM_ISR));
    break;
#endif //TIM6_BASE

#if defined(TIM7_BASE)
  case TIMER7_INDEX:
    ISR_Set_TIM7_IRQHandler(_REMAP_ISR_NAME(TIM7_IRQHandler, ArduinoTIM_ISR));
    break;
#endif //TIM7_BASE

#if defined(TIM8_BASE)
  case TIMER8_INDEX:
    ISR_Set_TIM8_UP_IRQHandler(_REMAP_ISR_NAME(TIM8_UP_IRQHandler, ArduinoTIM_ISR));
    ISR_Set_TIM8_CC_IRQHandler(_REMAP_ISR_NAME(TIM8_CC_IRQHandler, ArduinoTIM_ISR));
    break;
#endif //TIM8_BASE

#if defined(TIM9_BASE)
  case TIMER9_INDEX:
    ISR_Set_TIM9_UP_IRQHandler(_REMAP_ISR_NAME(TIM9_UP_IRQHandler, ArduinoTIM_ISR));
    ISR_Set_TIM9_CC_IRQHandler(_REMAP_ISR_NAME(TIM9_CC_IRQHandler, ArduinoTIM_ISR));
    break;
#endif //TIM9_BASE

#if defined(TIM10_BASE)
  case TIMER10_INDEX:
    ISR_Set_TIM10_UP_IRQHandler(_REMAP_ISR_NAME(TIM10_UP_IRQHandler, ArduinoTIM_ISR));
    ISR_Set_TIM10_CC_IRQHandler(_REMAP_ISR_NAME(TIM10_CC_IRQHandler, ArduinoTIM_ISR));
    break;
#endif //TIM10_BASE
  }
#endif

  /* Configure timer with some default values */

  _timerObj.handle.Init.TIM_Prescaler     = 0;
  _timerObj.handle.Init.TIM_Period        = MAX_RELOAD;
  _timerObj.handle.Init.TIM_CounterMode   = TIM_CounterMode_Up;
  _timerObj.handle.Init.TIM_ClockDivision = TIM_CKD_DIV1;


#if defined(TIM_RCR_REP)
  _timerObj.handle.Init.TIM_RepetitionCounter = 0;
#endif
  TIM_ARRPreloadConfig( _timerObj.handle.Instance, ENABLE );
  TIM_TimeBaseInit( _timerObj.handle.Instance, &_timerObj.handle.Init);

}


/**
  * @brief  Pause HardwareTimer: stop timer
  * @param  None
  * @retval None
  */
void HardwareTimer::pause()
{
  // Disable all IT
  TIM_ITConfig(_timerObj.handle.Instance, TIM_IT_Update|TIM_IT_CC1|TIM_IT_CC2|TIM_IT_CC3|TIM_IT_CC4, DISABLE);
  // Stop timer. Required to restore HAL State: HAL_TIM_STATE_READY
  TIM_Cmd(_timerObj.handle.Instance,DISABLE);
}

/**
  * @brief  Pause only one channel.
  *         Timer is still running but channel is disabled (output and interrupt)
  * @param  Arduino channel [1..4]
  * @retval None
  */
void HardwareTimer::pauseChannel(uint32_t channel)
{
  int timAssociatedInputChannel;
  int LLChannel = getLLChannel(channel);
  if (LLChannel == -1) {
    Error_Handler();
  }

  int interrupt = getIT(channel);
  if (interrupt == -1) {
    Error_Handler();
  }

  // Disable channel and corresponding interrupt
  TIM_ITConfig(_timerObj.handle.Instance, interrupt, DISABLE);
  TIM_CCxCmd(_timerObj.handle.Instance,LLChannel,TIM_CCx_Disable);

#if defined(TIM_CHANNEL_STATE_SET)
  /* Starting from G4, new Channel state implementation prevents to restart a channel,
     if the channel has not been explicitly be stopped with HAL interface */
#if defined(TIM_CHANNEL_N_STATE_SET)
  if (isComplementaryChannel[channel - 1]) 
  {
    // TIM_CHANNEL_N_STATE_SET(&(_timerObj.handle), getChannel(channel), HAL_TIM_CHANNEL_STATE_READY);
  } 
  else
#endif
  {
    // TIM_CHANNEL_STATE_SET(&(_timerObj.handle), getChannel(channel), HAL_TIM_CHANNEL_STATE_READY);
  }
#endif

  // In case 2 channels are used, disable also the 2nd one
  if (_ChannelMode[channel - 1] == TIMER_INPUT_FREQ_DUTY_MEASUREMENT) 
  {
      // Identify and configure 2nd associated channel
      timAssociatedInputChannel = getAssociatedChannel(channel);
      TIM_ITConfig(_timerObj.handle.Instance, getIT(timAssociatedInputChannel), DISABLE);
      TIM_CCxCmd(_timerObj.handle.Instance,getLLChannel(timAssociatedInputChannel),TIM_CCx_Disable);
  }
}

/**
  * @brief  Start or resume HardwareTimer: all channels are resumed, interrupts are enabled if necessary
  * @param  None
  * @retval None
  */
void HardwareTimer::resume(void)
{
  // Clear flag and enable IT
  if (callbacks[0])  // 0 for update
  {
    TIM_ClearFlag(_timerObj.handle.Instance,TIM_FLAG_Update );  
    TIM_ITConfig(_timerObj.handle.Instance, TIM_IT_Update, ENABLE);
    // Start timer in Time base mode. Required when there is no channel used but only update interrupt.
    TIM_Cmd(_timerObj.handle.Instance, ENABLE );
  }
  // Resume all channels
  resumeChannel(1);
  resumeChannel(2);
  resumeChannel(3);
  resumeChannel(4);
}

/**
  * @brief  Convert arduino channel into HAL channel
  * @param  Arduino channel [1..4]
  * @retval HAL channel. return -1 if arduino channel is invalid
  */
 //CHANNEL 
int HardwareTimer::getChannel(uint32_t channel)
{
  uint32_t return_value;

  switch (channel) {
    case 1:
      return_value = TIM_Channel_1;
      break;
    case 2:
      return_value = TIM_Channel_2;
      break;
    case 3:
      return_value = TIM_Channel_3;
      break;
    case 4:
      return_value = TIM_Channel_4;
      break;
    default:
      return_value = -1;
  }
  return return_value;
}

/**
  * @brief  Convert arduino channel into LL channel
  * @param  Arduino channel [1..4]
  * @retval LL channel. return -1 if arduino channel is invalid
  */
 //CHANNEL P or N
int HardwareTimer::getLLChannel(uint32_t channel)
{
  uint32_t return_value;
#if defined(TIM_CC1NE)
  if (isComplementaryChannel[channel - 1]) {
    // Complementary channel
    switch (channel) {
      case 1:
        return_value = TIM_CHANNEL_CH1N;
        break;
      case 2:
        return_value = TIM_CHANNEL_CH2N;
        break;
      case 3:
        return_value = TIM_CHANNEL_CH3N;
        break;
#if defined(TIM_CHANNEL_CH4N)
      case 4:
        return_value = TIM_CHANNEL_CH4N;
        break;
#endif
      default:
        return_value = -1;
    }
  } 
  else
#endif
  {
    // Regular channel not complementary
    switch (channel) {
      case 1:
        return_value = TIM_CHANNEL_CH1;
        break;
      case 2:
        return_value = TIM_CHANNEL_CH2;
        break;
      case 3:
        return_value = TIM_CHANNEL_CH3;
        break;
      case 4:
        return_value = TIM_CHANNEL_CH4;
        break;
      default:
        return_value = -1;
    }
  }
  return return_value;
}

/**
  * @brief  Convert arduino channel into HAL Interrupt ID
  * @param  Arduino channel [1..4]
  * @retval HAL channel. return -1 if arduino channel is invalid
  */
int HardwareTimer::getIT(uint32_t channel)
{
  uint32_t return_value;

  switch (channel) {
    case 1:
      return_value = TIM_IT_CC1;
      break;
    case 2:
      return_value = TIM_IT_CC2;
      break;
    case 3:
      return_value = TIM_IT_CC3;
      break;
    case 4:
      return_value = TIM_IT_CC4;
      break;
    default:
      return_value = -1;
  }
  return return_value;
}

/**
  * @brief  Get input associated channel
  *         Channel 1 and 2 are associated; channel 3 and 4 are associated
  * @param  Arduino channel [1..4]
  * @retval HAL channel. return -1 if arduino channel is invalid
  */
int HardwareTimer::getAssociatedChannel(uint32_t channel)
{
  int timAssociatedInputChannel = -1;
  switch (channel) {
    case 1:
      timAssociatedInputChannel = 2;
      break;
    case 2:
      timAssociatedInputChannel = 1;
      break;
    case 3:
      timAssociatedInputChannel = 4;
      break;
    case 4:
      timAssociatedInputChannel = 3;
      break;
    default:
      break;
  }
  return timAssociatedInputChannel;
}

/**
  * @brief  Configure specified channel and resume/start timer
  * @param  Arduino channel [1..4]
  * @retval None
  */
void HardwareTimer::resumeChannel(uint32_t channel)
{
  int timChannel = getChannel(channel); 
  int timAssociatedInputChannel;
  if (timChannel == -1) {
    Error_Handler();
  }

