morpheby/arduino_core_ch32/cores/arduino/HardwareTimer.cpp
  int interrupt = getIT(channel);
  if (interrupt == -1) {
    Error_Handler();
  }

  int LLChannel = getLLChannel(channel);
  if (LLChannel == -1) {
    Error_Handler();
  }

  // Clear flag and enable IT
  if (callbacks[channel]) {
    TIM_ClearFlag(_timerObj.handle.Instance,interrupt );  
    TIM_ITConfig(_timerObj.handle.Instance, interrupt, ENABLE);
  }

  switch (_ChannelMode[channel - 1])
  {
    case TIMER_OUTPUT_COMPARE_PWM1:
    case TIMER_OUTPUT_COMPARE_PWM2: 
    {
#if defined(TIM_CC1NE)
        if (isComplementaryChannel[channel - 1]) 
        {
          TIM_CCxNCmd( _timerObj.handle.Instance, timChannel, TIM_CCxN_Enable );
          _timerObj.handle.Instance->BDTR |= TIM_MOE;   //MOE ENABLE
          TIM_Cmd( _timerObj.handle.Instance, ENABLE );
        } 
        else
#endif
        {
          TIM_CCxCmd( _timerObj.handle.Instance, timChannel, TIM_CCx_Enable );
          _timerObj.handle.Instance->BDTR |= TIM_MOE;   //MOE ENABLE
          TIM_Cmd( _timerObj.handle.Instance, ENABLE );
        }
      }
      break;
    case TIMER_OUTPUT_COMPARE_ACTIVE:
    case TIMER_OUTPUT_COMPARE_INACTIVE:
    case TIMER_OUTPUT_COMPARE_TOGGLE:
    case TIMER_OUTPUT_COMPARE_FORCED_ACTIVE:
    case TIMER_OUTPUT_COMPARE_FORCED_INACTIVE: 
    {
#if defined(TIM_CC1NE)
        if (isComplementaryChannel[channel - 1]) 
        {
          // HAL_TIMEx_OCN_Start(&(_timerObj.handle), timChannel);
          TIM_CCxNCmd( _timerObj.handle.Instance, timChannel, TIM_CCxN_Enable );
          _timerObj.handle.Instance->BDTR |= TIM_MOE;   //MOE ENABLE
          TIM_Cmd( _timerObj.handle.Instance, ENABLE );
        } 
        else
#endif
        {
          // HAL_TIM_OC_Start(&(_timerObj.handle), timChannel);
          TIM_CCxCmd( _timerObj.handle.Instance, timChannel, TIM_CCx_Enable );
          _timerObj.handle.Instance->BDTR |= TIM_MOE;   //MOE ENABLE
          TIM_Cmd( _timerObj.handle.Instance, ENABLE );
        }
      }
      break;
    case TIMER_INPUT_FREQ_DUTY_MEASUREMENT: {
        TIM_CCxCmd( _timerObj.handle.Instance, timChannel, TIM_CCx_Enable );
        // Enable 2nd associated channel
        //两个关联通道，配置为捕获通道   1 & 2  /  3 & 4        
        timAssociatedInputChannel = getAssociatedChannel(channel);
        TIM_CCxCmd( _timerObj.handle.Instance, getLLChannel(timAssociatedInputChannel), TIM_CCx_Enable );
       
        _timerObj.handle.Instance->BDTR |= TIM_MOE;   //MOE ENABLE

         TIM_Cmd( _timerObj.handle.Instance, ENABLE );
        if (callbacks[channel]) 
        {
          TIM_ClearFlag(_timerObj.handle.Instance,getIT(timAssociatedInputChannel));      
          TIM_ITConfig(_timerObj.handle.Instance,getIT(timAssociatedInputChannel),ENABLE);
        }
      }
      break;
    case TIMER_INPUT_CAPTURE_RISING:
    case TIMER_INPUT_CAPTURE_FALLING:
    case TIMER_INPUT_CAPTURE_BOTHEDGE: {

        TIM_CCxCmd( _timerObj.handle.Instance, timChannel, TIM_CCx_Enable );
        _timerObj.handle.Instance->BDTR |= TIM_MOE;   //MOE ENABLE
        TIM_Cmd( _timerObj.handle.Instance, ENABLE );
        // HAL_TIM_IC_Start(&(_timerObj.handle), timChannel);
      }
      break;
    case TIMER_OUTPUT_COMPARE:
    case TIMER_DISABLED:
       if (!(_timerObj.handle.Instance->CTLR1 & TIM_CEN) ) //if not enable 
       { 
          TIM_Cmd( _timerObj.handle.Instance, ENABLE ) ; 
       }
      break;
    case TIMER_NOT_USED:
    default :
      break;
  }
}


/**
  * @brief  Configure comparison output channels
  * @param   timerX, TIM_OCInitTypeDef,  Arduino channel [1..4] 
  * @retval None
  */
void HardwareTimer::TIM_OC_ConfigChannel_Static(TIM_TypeDef *tim, TIM_OCInitTypeDef *sConfig, uint32_t Channel)
{
   switch (Channel)
  {
    case TIM_Channel_1:
    {
      /* Configure the TIM Channel 1 in Output Compare */
      TIM_OC1Init(tim,sConfig);
      break;
    }

    case TIM_Channel_2:
    {
      /* Configure the TIM Channel 2 in Output Compare */
      TIM_OC2Init(tim,sConfig);
      break;
    }

    case TIM_Channel_3:
    {
      /* Configure the TIM Channel 3 in Output Compare */
      TIM_OC3Init(tim,sConfig);
      break;
    }

    case TIM_Channel_4:
    {
      /* Configure the TIM Channel 4 in Output Compare */
      TIM_OC4Init(tim,sConfig);
      break;
    }

    default:
      break;
  }   
}

/**
  * @brief  Configure input capture channels
  * @param   timerX, TIM_ICInitTypeDef,  Arduino channel [1..4] 
  * @retval None
  */
void HardwareTimer::TIM_IC_ConfigChannel_Static(TIM_TypeDef *tim, TIM_ICInitTypeDef *sConfig, uint32_t Channel)
{

  sConfig->TIM_Channel = Channel;

  TIM_ICInit( tim,  sConfig);

  if(Channel == TIM_Channel_1)
  {
      TIM_SetIC1Prescaler(tim, sConfig->TIM_ICPrescaler);
  }
  else if(Channel == TIM_Channel_2)
  {
      TIM_SetIC2Prescaler(tim, sConfig->TIM_ICPrescaler);
  }
  else if(Channel == TIM_Channel_3)
  {
      TIM_SetIC3Prescaler(tim, sConfig->TIM_ICPrescaler);
  }
  else
  {
      TIM_SetIC4Prescaler(tim, sConfig->TIM_ICPrescaler);
  }

}


/**
  * @brief  Retrieve prescaler from hardware register
  * @param  None
  * @retval prescaler factor
  */
uint32_t HardwareTimer::getPrescaleFactor()
{
  // Hardware register correspond to prescaler-1. Example PSC register value 0 means divided by 1
  return (TIM_GetPrescaler( _timerObj.handle.Instance )+1);
}

/**
  * @brief  Configure hardwareTimer prescaler
  * @param  prescaler factor
  * @retval None
  */
void HardwareTimer::setPrescaleFactor(uint32_t prescaler)
{
  // Hardware register correspond to prescaler-1. Example PSC register value 0 means divided by 1
  _timerObj.handle.Instance->PSC = prescaler - 1;
  updateRegistersIfNotRunning(_timerObj.handle.Instance);
}

/**
  * @brief  Retrieve overflow (rollover) value from hardware register
  * @param  format of returned value. If omitted default format is Tick
  * @retval overflow depending on format value:
  *           TICK_FORMAT:     return number of tick for overflow
  *           MICROSEC_FORMAT: return number of microsecondes for overflow
  *           HERTZ_FORMAT:    return frequency in hertz for overflow
  */
uint32_t HardwareTimer::getOverflow(TimerFormat_t format)
{
  // Hardware register correspond to period count-1. Example ARR register value 9 means period of 10 timer cycle
  uint32_t ARR_RegisterValue = _timerObj.handle.Instance->ATRLR;

