morpheby/arduino_core_ch32/cores/arduino/HardwareTimer.cpp
  switch (mode) {
    case TIMER_DISABLED:
      channelOC.TIM_OCMode = TIM_OCMode_Timing;

      TIM_OC_ConfigChannel_Static(_timerObj.handle.Instance, &channelOC, timChannel);
      break;
    case TIMER_OUTPUT_COMPARE:
      /* In case of TIMER_OUTPUT_COMPARE, there is no output and thus no pin to
       * configure, and no channel. So nothing to do. For compatibility reason
       * restore TIMER_DISABLED if necessary.
       */
      if (_ChannelMode[channel - 1] != TIMER_DISABLED) {
        _ChannelMode[channel - 1] = TIMER_DISABLED;
        channelOC.TIM_OCMode = TIM_OCMode_Timing;

        TIM_OC_ConfigChannel_Static(_timerObj.handle.Instance, &channelOC, timChannel);
      }
      return;
    case TIMER_OUTPUT_COMPARE_ACTIVE:
      channelOC.TIM_OCMode = TIM_OCMode_Active;
      TIM_OC_ConfigChannel_Static(_timerObj.handle.Instance, &channelOC, timChannel);

      break;
    case TIMER_OUTPUT_COMPARE_INACTIVE:
      channelOC.TIM_OCMode = TIM_OCMode_Inactive;
      TIM_OC_ConfigChannel_Static(_timerObj.handle.Instance, &channelOC, timChannel);
      break;
    case TIMER_OUTPUT_COMPARE_TOGGLE:
      channelOC.TIM_OCMode = TIM_OCMode_Toggle;
      TIM_OC_ConfigChannel_Static(_timerObj.handle.Instance, &channelOC, timChannel);
      break;
    case TIMER_OUTPUT_COMPARE_PWM1:
      channelOC.TIM_OCMode = TIM_OCMode_PWM1;
      TIM_OC_ConfigChannel_Static(_timerObj.handle.Instance, &channelOC, timChannel);      
      break;
    case TIMER_OUTPUT_COMPARE_PWM2:
      channelOC.TIM_OCMode = TIM_OCMode_PWM2;
      TIM_OC_ConfigChannel_Static(_timerObj.handle.Instance, &channelOC, timChannel);
      break;
    
    case TIMER_OUTPUT_COMPARE_FORCED_ACTIVE:
      channelOC.TIM_OCMode = 0x0050;   //force high
      TIM_OC_ConfigChannel_Static(_timerObj.handle.Instance, &channelOC, timChannel);
      break;
    case TIMER_OUTPUT_COMPARE_FORCED_INACTIVE:
      channelOC.TIM_OCMode = 0x0040;   //force low
      TIM_OC_ConfigChannel_Static(_timerObj.handle.Instance, &channelOC, timChannel);
      break;
    case TIMER_INPUT_CAPTURE_RISING:
      channelIC.TIM_ICPolarity = TIM_ICPolarity_Rising;
      TIM_IC_ConfigChannel_Static(_timerObj.handle.Instance, &channelIC,timChannel);
      break;
    case TIMER_INPUT_CAPTURE_FALLING:
      channelIC.TIM_ICPolarity = TIM_ICPolarity_Falling;
      TIM_IC_ConfigChannel_Static(_timerObj.handle.Instance, &channelIC,timChannel);
      break;
    case TIMER_INPUT_CAPTURE_BOTHEDGE:
      channelIC.TIM_ICPolarity = TIM_ICPolarity_BothEdge;
      TIM_IC_ConfigChannel_Static(_timerObj.handle.Instance, &channelIC,timChannel);      
      break;
    case TIMER_INPUT_FREQ_DUTY_MEASUREMENT:
      // Configure 1st channel
      channelIC.TIM_ICPolarity = TIM_ICPolarity_Rising;
      channelIC.TIM_ICSelection = TIM_ICSelection_DirectTI;
      TIM_IC_ConfigChannel_Static(_timerObj.handle.Instance, &channelIC, timChannel); 
      // // Identify and configure 2nd associated channel
      timAssociatedInputChannel = getAssociatedChannel(channel);
      _ChannelMode[timAssociatedInputChannel - 1] = mode;
      channelIC.TIM_ICPolarity = TIM_ICPolarity_Falling;
      channelIC.TIM_ICSelection = TIM_ICSelection_IndirectTI;
      TIM_IC_ConfigChannel_Static(_timerObj.handle.Instance, &channelIC, timChannel);    
      break;
    default:
      break;
  }
  // Save channel selected mode to object attribute
  _ChannelMode[channel - 1] = mode;
  if (pin != NC) 
  {
    if ((int)getTimerChannel(pin) == timChannel) 
    {
      /* Configure PWM GPIO pins */
      pinmap_pinout(pin, PinMap_TIM);
      if ((mode == TIMER_INPUT_CAPTURE_RISING) || (mode == TIMER_INPUT_CAPTURE_FALLING) \
          || (mode == TIMER_INPUT_CAPTURE_BOTHEDGE) || (mode == TIMER_INPUT_FREQ_DUTY_MEASUREMENT)) 
      {
          //input alternate function must configure GPIO in input mode
          pinMode(pinNametoDigitalPin(pin), INPUT);  //set input
      }
    } 
    else
     {
      // Pin doesn't match with timer output channels
      Error_Handler();
    }

#if defined(TIM_CC1NE)
     isComplementaryChannel[channel - 1] = CH_PIN_INVERTED(pinmap_function(pin, PinMap_TIM)); //(x>>20)&0x1 
#endif
  }
}

/**
  * @brief  Retrieves channel mode configured
  * @param  channel: Arduino channel [1..4]
  * @retval returns configured mode
  */
TimerModes_t HardwareTimer::getMode(uint32_t channel)
{
  if ((1 <= channel) && (channel <= TIMER_CHANNELS)) {
    return _ChannelMode[channel - 1];
  } else {
    return TIMER_DISABLED;
  }
}

/**
  * @brief  Enable or disable preloading for overflow value
  *         When disabled, changes to the overflow value take effect
  *         immediately. When enabled (the default), the value takes
  *         effect only at the next update event (typically the next
  *         overflow).
  *
  *         Note that the capture/compare register has its own preload
  *         enable bit, which is independent and enabled in PWM modes
  *         and disabled otherwise. If you need more control of that
  *         bit, you can use the HAL functions directly.
  * @param  value: true to enable preloading, false to disable
  * @retval None
  */
void HardwareTimer::setPreloadEnable(bool value)
{
  if (value) {
    TIM_ARRPreloadConfig( _timerObj.handle.Instance, ENABLE );

  } else {
    TIM_ARRPreloadConfig( _timerObj.handle.Instance, DISABLE );
  }
}

/**
  * @brief  Set channel Capture/Compare register
  * @param  channel: Arduino channel [1..4]
  * @param  compare: compare value depending on format
  * @param  format of compare parameter. If omitted default format is Tick
  *           TICK_FORMAT:     compare is the number of tick
  *           MICROSEC_FORMAT: compare is the number of microsecondes
  *           HERTZ_FORMAT:    compare is the frequency in hertz
  * @retval None
  */
void HardwareTimer::setCaptureCompare(uint32_t channel, uint32_t compare, TimerCompareFormat_t format)
{
  int timChannel = getChannel(channel);
  uint32_t Prescalerfactor = TIM_GetPrescaler(_timerObj.handle.Instance) + 1;
  uint32_t CCR_RegisterValue;

  if (timChannel == -1) {
    Error_Handler();
  }
  switch (format) {
    case MICROSEC_COMPARE_FORMAT:
      CCR_RegisterValue = ((compare * (getTimerClkFreq() / 1000000)) / Prescalerfactor);
      break;
    case HERTZ_COMPARE_FORMAT:
      CCR_RegisterValue = getTimerClkFreq() / (compare * Prescalerfactor);
      break;
    // As per Reference Manual PWM reach 100% with CCRx value strictly greater than ARR (So ARR+1 in our case)
    case PERCENT_COMPARE_FORMAT:
      CCR_RegisterValue = ((_timerObj.handle.Instance->ATRLR  + 1) * compare) / 100;
      break;
    case RESOLUTION_1B_COMPARE_FORMAT:
    case RESOLUTION_2B_COMPARE_FORMAT:
    case RESOLUTION_3B_COMPARE_FORMAT:
    case RESOLUTION_4B_COMPARE_FORMAT:
    case RESOLUTION_5B_COMPARE_FORMAT:
    case RESOLUTION_6B_COMPARE_FORMAT:
    case RESOLUTION_7B_COMPARE_FORMAT:
    case RESOLUTION_8B_COMPARE_FORMAT:
    case RESOLUTION_9B_COMPARE_FORMAT:
    case RESOLUTION_10B_COMPARE_FORMAT:
    case RESOLUTION_11B_COMPARE_FORMAT:
    case RESOLUTION_12B_COMPARE_FORMAT:
    case RESOLUTION_13B_COMPARE_FORMAT:
    case RESOLUTION_14B_COMPARE_FORMAT:
    case RESOLUTION_15B_COMPARE_FORMAT:
    case RESOLUTION_16B_COMPARE_FORMAT:
      CCR_RegisterValue = (( _timerObj.handle.Instance->ATRLR + 1 ) * compare ) / ( (1 << format) -1 );
      break;
    case TICK_COMPARE_FORMAT:
    default :
      CCR_RegisterValue = compare;
      break;
  }

  // Special case when ARR is set to the max value, it is not possible to set CCRx to ARR+1 to reach 100%
  // Then set CCRx to max value. PWM is then 1/0xFFFF = 99.998..%
  if( (( _timerObj.handle.Instance->ATRLR ) == MAX_RELOAD) && (CCR_RegisterValue == MAX_RELOAD + 1))
  {
    CCR_RegisterValue = MAX_RELOAD;
  }

