morpheby/arduino_core_ch32/cores/arduino/HardwareTimer.cpp
  if (!htim) {
    Error_Handler();
  }

  if(TIM_GetITStatus(htim->Instance, TIM_IT_Update) && (htim->Instance->DMAINTENR & TIM_IT_Update))
  {

    timerObj_t *obj = get_timer_obj(htim);
    HardwareTimer *HT = (HardwareTimer *)(obj->__this);

    if (HT->callbacks[0]) {
      HT->callbacks[0]();
    }
    TIM_ClearITPendingBit(htim->Instance, TIM_IT_Update);
  }
}

/**
  * @brief  Generic Capture and Compare callback which will call user callback
  * @param  htim: HAL timer handle
  * @retval None
  */
void HardwareTimer::captureCompareCallback(TIM_HandleTypeDef *htim)
{
  if (!htim) {
    Error_Handler();
  }

 uint32_t channel = 0;

if( (htim->Instance->DMAINTENR & TIM_IT_CC1) || (htim->Instance->DMAINTENR & TIM_IT_CC2) \
 || (htim->Instance->DMAINTENR & TIM_IT_CC3) || (htim->Instance->DMAINTENR & TIM_IT_CC4) )
{
 if( TIM_GetITStatus(htim->Instance, TIM_IT_CC1) ) 
 {
    channel = 1;
    TIM_ClearITPendingBit( htim->Instance, TIM_IT_CC1);
 }
 else if(TIM_GetITStatus(htim->Instance, TIM_IT_CC2) )
 {
    channel = 2;
    TIM_ClearITPendingBit( htim->Instance, TIM_IT_CC2);
 }
 else if(TIM_GetITStatus(htim->Instance, TIM_IT_CC3) )
 {
    channel = 3;
    TIM_ClearITPendingBit( htim->Instance, TIM_IT_CC3);
 }
 else if(TIM_GetITStatus(htim->Instance, TIM_IT_CC4) )
 {
    channel = 4;
    TIM_ClearITPendingBit( htim->Instance, TIM_IT_CC4);
 }

  timerObj_t *obj = get_timer_obj(htim);
  HardwareTimer *HT = (HardwareTimer *)(obj->__this);
  if (HT->callbacks[channel]) {
    HT->callbacks[channel]();
  }
}
}

/**
  * @brief  Check whether HardwareTimer is running (paused or resumed).
  * @retval return true if the HardwareTimer is running
  */
bool HardwareTimer::isRunning()
{
  // return LL_TIM_IsEnabledCounter(_timerObj.handle.Instance);
  return  (((_timerObj.handle.Instance->CTLR1 & TIM_CEN) == TIM_CEN)? 1UL : 0UL) ;
}

/**
  * @brief  Check whether channel is running (paused or resumed).
  * @param  channel: Arduino channel [1..4]
  * @retval return true if HardwareTimer is running and the channel is enabled
  */
bool HardwareTimer::isRunningChannel(uint32_t channel)
{
  int LLChannel = getLLChannel(channel);
  int interrupt = getIT(channel);
  bool ret;

  if (LLChannel == -1) {
    Error_Handler();
  }

  if (interrupt == -1) {
    Error_Handler();
  }

  // channel is running if: timer is running, and either output channel is
  // enabled or interrupt is set
  ret =  ((_timerObj.handle.Instance->CCER & LLChannel) == LLChannel ? 1UL : 0UL) \
        || ((_timerObj.handle.Instance->DMAINTENR & interrupt) == interrupt ? 1UL : 0UL) ;  

  return (isRunning() && ret);
}

/**
  * @brief  Take into account registers update immediately if timer is not running,
  *         (independently from Preload setting)
  * @param  TIMx Timer instance
  * @retval None
  */
void HardwareTimer::updateRegistersIfNotRunning(TIM_TypeDef *TIMx)
{
  if (!isRunning()) {
    if (_timerObj.handle.Instance->DMAINTENR & TIM_IT_Update) 
    {
      // prevent Interrupt generation from refresh()
      TIM_ITConfig(_timerObj.handle.Instance, TIM_IT_Update, DISABLE);
      refresh( );
      TIM_ClearFlag(_timerObj.handle.Instance, TIM_IT_Update); 
      TIM_ITConfig(_timerObj.handle.Instance, TIM_IT_Update, ENABLE);

    } else {
      refresh();
    }
  }
}

/**
  * @brief  HardwareTimer destructor
  * @retval None
  */
HardwareTimer::~HardwareTimer()
{
  uint32_t index = get_timer_index(_timerObj.handle.Instance);
  disableTimerClock(&(_timerObj.handle));
  HardwareTimer_Handle[index] = NULL;
  _timerObj.__this = NULL;
}

/**
  * @brief  return timer index from timer handle
  * @param  htim : one of the defined timer
  * @retval timer index
  */
timer_index_t get_timer_index(TIM_TypeDef *instance)
{
  timer_index_t index = UNKNOWN_TIMER;

#if defined(TIM1_BASE)
  if (instance == TIM1) {
    index = TIMER1_INDEX;
  }
#endif
#if defined(TIM2_BASE)
  if (instance == TIM2) {
    index = TIMER2_INDEX;
  }
#endif
#if defined(TIM3_BASE)
  if (instance == TIM3) {
    index = TIMER3_INDEX;
  }
#endif
#if defined(TIM4_BASE)
  if (instance == TIM4) {
    index = TIMER4_INDEX;
  }
#endif
#if defined(TIM5_BASE)
  if (instance == TIM5) {
    index = TIMER5_INDEX;
  }
#endif
#if defined(TIM6_BASE)
  if (instance == TIM6) {
    index = TIMER6_INDEX;
  }
#endif
#if defined(TIM7_BASE)
  if (instance == TIM7) {
    index = TIMER7_INDEX;
  }
#endif
#if defined(TIM8_BASE)
  if (instance == TIM8) {
    index = TIMER8_INDEX;
  }
#endif
#if defined(TIM9_BASE)
  if (instance == TIM9) {
    index = TIMER9_INDEX;
  }
#endif
#if defined(TIM10_BASE)
  if (instance == TIM10) {
    index = TIMER10_INDEX;
  }
#endif

  return index;
}

/**
  * @brief  This function return the timer clock frequency.
  * @param  None
  * @retval frequency in Hz
  */
uint32_t HardwareTimer::getTimerClkFreq()
{
  switch (getTimerClkSrc(_timerObj.handle.Instance)) 
  {
    case 1:
        return ch32::clock::current_clock_configuration().timer2_3_4_5_6_7_frequency_hz();
    case 2:
        return ch32::clock::current_clock_configuration().timer1_8_9_10_11_frequency_hz();
    default:
    case 0: // Unknown timer clock source
      Error_Handler();
      return 0;
  }
}

/**
  * @brief  This function will reset the timer
  * @param  None
  * @retval None
  */
void HardwareTimer::timerHandleDeinit()
{
    TIM_Cmd(_timerObj.handle.Instance, DISABLE);
    TIM_DeInit(_timerObj.handle.Instance);
}





/******************************************************************************/
/*                            TIMx IRQ HANDLER                                */
/******************************************************************************/

#if defined(TIM1_BASE)
  /**
    * @brief  TIM1 IRQHandler 
    * @param  None
    * @retval None
    */
  _TIM_ISR(TIM1_UP_IRQHandler)
  {
    if (HardwareTimer_Handle[TIMER1_INDEX]) {
      HardwareTimer::updateCallback(&HardwareTimer_Handle[TIMER1_INDEX]->handle);
    }
  }
  _TIM_ISR(TIM1_CC_IRQHandler)
  {
    if (HardwareTimer_Handle[TIMER1_INDEX]) {
      HardwareTimer::captureCompareCallback(&HardwareTimer_Handle[TIMER1_INDEX]->handle);
    }
  }
#endif //TIM1_BASE

#if defined(TIM2_BASE)

  #if defined(CH32X035)
     /**
    * @brief  TIM1 IRQHandler 
    * @param  None
    * @retval None
    */
  _TIM_ISR(TIM2_UP_IRQHandler)
  {
    if (HardwareTimer_Handle[TIMER2_INDEX]) {
      HardwareTimer::updateCallback(&HardwareTimer_Handle[TIMER2_INDEX]->handle);
    }
  }

  _TIM_ISR(TIM2_CC_IRQHandler)
  {
    if (HardwareTimer_Handle[TIMER2_INDEX]) {
      HardwareTimer::captureCompareCallback(&HardwareTimer_Handle[TIMER2_INDEX]->handle);
    }
  }

  #else
  /**
    * @brief  TIM2 IRQHandler
    * @param  None
    * @retval None
    */
  _TIM_ISR(TIM2_IRQHandler)
  {
    if (HardwareTimer_Handle[TIMER2_INDEX]) 
    {
      HardwareTimer::updateCallback(&HardwareTimer_Handle[TIMER2_INDEX]->handle);
      HardwareTimer::captureCompareCallback(&HardwareTimer_Handle[TIMER2_INDEX]->handle);
    }
  }
  #endif

#endif //TIM2_BASE

#if defined(TIM3_BASE)
  /**
    * @brief  TIM3 IRQHandler
    * @param  None
    * @retval None
    */
  _TIM_ISR(TIM3_IRQHandler)
  {
    if (HardwareTimer_Handle[TIMER3_INDEX]) {
      HardwareTimer::updateCallback(&HardwareTimer_Handle[TIMER3_INDEX]->handle);
      HardwareTimer::captureCompareCallback(&HardwareTimer_Handle[TIMER3_INDEX]->handle);
    }
  }
#endif //TIM3_BASE

#if defined(TIM4_BASE)
  /**
    * @brief  TIM4 IRQHandler
    * @param  None
    * @retval None
    */
  _TIM_ISR(TIM4_IRQHandler)
  {
    if (HardwareTimer_Handle[TIMER4_INDEX]) {
       HardwareTimer::updateCallback(&HardwareTimer_Handle[TIMER4_INDEX]->handle);
       HardwareTimer::captureCompareCallback(&HardwareTimer_Handle[TIMER4_INDEX]->handle);
    }
  }
#endif //TIM4_BASE

#if defined(TIM5_BASE)
  /**
    * @brief  TIM5 IRQHandler
    * @param  None
    * @retval None
    */
  _TIM_ISR(TIM5_IRQHandler)
  {
    if (HardwareTimer_Handle[TIMER5_INDEX]) {
       HardwareTimer::updateCallback(&HardwareTimer_Handle[TIMER5_INDEX]->handle);
       HardwareTimer::captureCompareCallback(&HardwareTimer_Handle[TIMER5_INDEX]->handle);
    }
  }
#endif //TIM5_BASE

