morpheby/arduino_core_ch32/cores/arduino/HardwareTimer.cpp
#if defined(TIM6_BASE)
  /**
    * @brief  TIM6 IRQHandler
    * @param  None
    * @retval None
    */
  _TIM_ISR(TIM6_IRQHandler)
  {
    if (HardwareTimer_Handle[TIMER6_INDEX]) {
       HardwareTimer::updateCallback(&HardwareTimer_Handle[TIMER6_INDEX]->handle);
       HardwareTimer::captureCompareCallback(&HardwareTimer_Handle[TIMER6_INDEX]->handle);
    }
  }
#endif //TIM6_BASE

#if defined(TIM7_BASE)
  /**
    * @brief  TIM7 IRQHandler
    * @param  None
    * @retval None
    */
  _TIM_ISR(TIM7_IRQHandler)
  {
    if (HardwareTimer_Handle[TIMER7_INDEX]) {
       HardwareTimer::updateCallback(&HardwareTimer_Handle[TIMER7_INDEX]->handle);
       HardwareTimer::captureCompareCallback(&HardwareTimer_Handle[TIMER7_INDEX]->handle);
    }
  }
#endif //TIM7_BASE

#if defined(TIM8_BASE)
  /**
    * @brief  TIM8 IRQHandler
    * @param  None
    * @retval None
    */
  _TIM_ISR(TIM8_UP_IRQHandler)
  {
    if (HardwareTimer_Handle[TIMER8_INDEX]) {
       HardwareTimer::updateCallback(&HardwareTimer_Handle[TIMER8_INDEX]->handle);
    }
  }
  _TIM_ISR(TIM8_CC_IRQHandler)
  {
    if (HardwareTimer_Handle[TIMER8_INDEX]) {
      HardwareTimer::captureCompareCallback(&HardwareTimer_Handle[TIMER8_INDEX]->handle);
    }
  }
#endif //TIM8_BASE

#if defined(TIM9_BASE)
  /**
    * @brief  TIM9 IRQHandler
    * @param  None
    * @retval None
    */
  _TIM_ISR(TIM9_UP_IRQHandler)
  {
    if (HardwareTimer_Handle[TIMER9_INDEX]) {
       HardwareTimer::updateCallback(&HardwareTimer_Handle[TIMER9_INDEX]->handle);
    }
  }
  _TIM_ISR(TIM9_CC_IRQHandler)
  {
    if(HardwareTimer_Handle[TIMER9_INDEX]){
        HardwareTimer::captureCompareCallback(&HardwareTimer_Handle[TIMER9_INDEX]->handle);
    }
  }
#endif //TIM9_BASE

#if defined(TIM10_BASE)
  /**
    * @brief  TIM10 IRQHandler
    * @param  None
    * @retval None
    */
  _TIM_ISR(TIM10_UP_IRQHandler)
  {
    if (HardwareTimer_Handle[TIMER10_INDEX]) {
       HardwareTimer::updateCallback(&HardwareTimer_Handle[TIMER10_INDEX]->handle);
    }
  }
  _TIM_ISR(TIM10_CC_IRQHandler)
  {
    if (HardwareTimer_Handle[TIMER10_INDEX]){
       HardwareTimer::captureCompareCallback(&HardwareTimer_Handle[TIMER10_INDEX]->handle);
    }
  }
#endif //TIM10_BASE

#endif // TIM_MODULE_ENABLED && !TIM_MODULE_ONLY
